# Задание 1
name = input('Введите имя')
print(f'приветствуем вас, уважаемый {name}.')